# Axis in Python

In [7]:
import warnings
warnings.filterwarnings('ignore')

In [21]:
import pandas as pd
import numpy as np

## Axis in Series

In [2]:
srs = pd.Series(['red', 'green', 'blue', 'white', 'black'])
srs

0      red
1    green
2     blue
3    white
4    black
dtype: object

In [3]:
srs_a = pd.Series([10,20,30,40,50])
srs_b = pd.Series(['red', 'green', 'blue', 'white', 'black'])
df = pd.DataFrame({'a':srs_a,
                   'b': srs_b})
df

    a      b
0  10    red
1  20  green
2  30   blue
3  40  white
4  50  black

In [5]:
df.loc[2,'b']

'blue'

### Drop Na along an axis

In [8]:
srs = pd.Series([1, 3, pd.np.nan, 4, pd.np.nan])
srs

0    1.0
1    3.0
2    NaN
3    4.0
4    NaN
dtype: float64

In [9]:
srs.dropna()

0    1.0
1    3.0
3    4.0
dtype: float64

In [10]:
srs.dropna(axis=0)

0    1.0
1    3.0
3    4.0
dtype: float64

## Axes in DataFrame

<li> Unlike Series, DataFrame API heavily relies on the axis parameter, because itâ€™s a two-dimensional data structure.
<li> Different operations can be performed along different axes producing totally different results.

In [11]:
srs_a = pd.Series([10,30,60,80,90])
srs_b = pd.Series([22, 44, 55, 77, 101])
df = pd.DataFrame({'a': srs_a, 'b': srs_b})
df

    a    b
0  10   22
1  30   44
2  60   55
3  80   77
4  90  101

In [12]:
df.sum(axis=1)

0     32
1     74
2    115
3    157
4    191
dtype: int64

In [13]:
df.sum(axis=0)

a    270
b    299
dtype: int64

##### <font color ='blue'> Note :  <li> (axis = 0) => (axis = 'index') or (axis = 'rows') </font>

#### Add up rows

In [18]:
df.sum(axis='rows')

a    270
b    299
dtype: int64

In [14]:
df.sum(axis='index')

a    270
b    299
dtype: int64

##### <font color ='blue'> Note : <li> (axis = 1) => (axis = 'columns') </font>

#### Add up columns

In [17]:
df.sum(axis = 'columns')

0     32
1     74
2    115
3    157
4    191
dtype: int64

### Dropping NaN

In [22]:
df = pd.DataFrame({
    'a': [2, np.nan, 8, 3], 
    'b': [np.nan, 32, 15, 7], 
    'c': [-3, 5, 22, 19]
})
df

     a     b   c
0  2.0   NaN  -3
1  NaN  32.0   5
2  8.0  15.0  22
3  3.0   7.0  19

In [23]:
df.dropna(axis=0)

     a     b   c
2  8.0  15.0  22
3  3.0   7.0  19

In [24]:
df.dropna(axis=1)

    c
0  -3
1   5
2  22
3  19

In [25]:
df1 = pd.DataFrame({'a': [1,3,6,8,9], 'b': ['red', 'green', 'blue', 'white', 'black']})
df2 = pd.DataFrame({'a': [0,2,4,5,7], 'b': ['jun', 'jul', 'aug', 'sep', 'oct']})

In [26]:
df1

   a      b
0  1    red
1  3  green
2  6   blue
3  8  white
4  9  black

In [27]:
df2

   a    b
0  0  jun
1  2  jul
2  4  aug
3  5  sep
4  7  oct

In [30]:
pd.concat([df1, df2], axis='rows')

   a      b
0  1    red
1  3  green
2  6   blue
3  8  white
4  9  black
0  0    jun
1  2    jul
2  4    aug
3  5    sep
4  7    oct

In [31]:
pd.concat([df1, df2], axis='columns')

   a      b  a    b
0  1    red  0  jun
1  3  green  2  jul
2  6   blue  4  aug
3  8  white  5  sep
4  9  black  7  oct